Revit 2024 API
ElementArray.ReverseIterator Method
Retrieve a backward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual ElementArrayIterator ReverseIterator()
Visual Basic
Public Overridable Function ReverseIterator As ElementArrayIterator
Visual C++
public:
virtual ElementArrayIterator^ ReverseIterator()
Return Value
Returns a backward moving iterator to the array.
See Also
ElementArray Class
Autodesk.Revit.DB Namespace